docs/hoverfly/bsf_data/credit_card/reqCustomerAccountCardInquiry_CustId_623990.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Body>
      <ns0:CustomerAccountCardInquiryRequest xmlns:ns0="http://ws.core.cortex.com/domain/services/custacccrdinq" xmlns:accId="http://ws.core.cortex.com/domain/id/accId" xmlns:accblk="http://ws.core.cortex.com/domain/types/accblk" xmlns:accdet="http://ws.core.cortex.com/domain/types/accdet" xmlns:addressdet="http://ws.core.cortex.com/domain/types/addressdet" xmlns:cardId="http://ws.core.cortex.com/domain/id/cardId" xmlns:ccaccdelq="http://ws.core.cortex.com/domain/types/ccaccdelq" xmlns:ccaccdet="http://ws.core.cortex.com/domain/types/ccaccdet" xmlns:ccaccstats="http://ws.core.cortex.com/domain/types/ccaccstats" xmlns:crddet="http://ws.core.cortex.com/domain/types/crddet" xmlns:crdpindet="http://ws.core.cortex.com/domain/types/crdpindet" xmlns:crdstatdet="http://ws.core.cortex.com/domain/types/crdstatdet" xmlns:crdsupdocdet="http://ws.core.cortex.com/domain/types/crdsupdocdet" xmlns:ctxtypes="http://ws.core.cortex.com/domain/types" xmlns:custId="http://ws.core.cortex.com/domain/id/custId" xmlns:custdet="http://ws.core.cortex.com/domain/types/custdet" xmlns:customVal="http://ws.core.cortex.com/domain/types/customval" xmlns:limdet="http://ws.core.cortex.com/domain/types/limdet" xmlns:ns1="http://ws.core.cortex.com/domain/id/currId" xmlns:ns2="http://ws.core.cortex.com/domain/common/security" xmlns:ns3="http://ws.core.cortex.com/domain/common/hdrusrdata" xmlns:ns4="http://ws.core.cortex.com/domain/types/cccycledet" xmlns:ns5="http://ws.core.cortex.com/domain/types/ctrydet" xmlns:proddet="http://ws.core.cortex.com/domain/types/crdproddet" xmlns:reqHdr="http://ws.core.cortex.com/domain/common/reqhdr" xmlns:risk="http://ws.core.cortex.com/domain/types/risk" xmlns:rspCardId="http://ws.core.cortex.com/domain/types/cardidrsp" xmlns:rspHdr="http://ws.core.cortex.com/domain/common/rsphdr">
         <reqHdr:RequestHeader>
            <reqHdr:Version>1.0.0</reqHdr:Version>
            <reqHdr:MsgUid>f250a1f5-6264-4bd4-8a93-05e47f71b19e</reqHdr:MsgUid>
            <reqHdr:Source>GETCARDSLIST</reqHdr:Source>
            <reqHdr:ServiceId>GETCARDSLIST</reqHdr:ServiceId>
            <reqHdr:ReqDateTime>2020-06-10-18:59:38.342</reqHdr:ReqDateTime>
         </reqHdr:RequestHeader>
         <ns0:CustomerAccountCardInquiryRequestDetails>
            <custId:CustomerIdentifier>
               <custId:CustomerCode>623990</custId:CustomerCode>
               <custId:InstitutionCode>BSF</custId:InstitutionCode>
            </custId:CustomerIdentifier>
            <ns0:AdditionalData>
               <ns0:ReturnCustomerDetails>false</ns0:ReturnCustomerDetails>
               <ns0:ReturnCustomerAddressDetails>false</ns0:ReturnCustomerAddressDetails>
               <ns0:ReturnAccountDetails>true</ns0:ReturnAccountDetails>
               <ns0:ReturnExtendedAccountDetails>false</ns0:ReturnExtendedAccountDetails>
               <ns0:ReturnFirstCardIdentifier>false</ns0:ReturnFirstCardIdentifier>
               <ns0:ReturnAccountCustomValues>false</ns0:ReturnAccountCustomValues>
               <ns0:ReturnCreditAccountDetails>true</ns0:ReturnCreditAccountDetails>
               <ns0:ReturnCreditAccountDueComponentsDetails>false</ns0:ReturnCreditAccountDueComponentsDetails>
               <ns0:ReturnCreditAccountNotDueComponentsDetails>false</ns0:ReturnCreditAccountNotDueComponentsDetails>
               <ns0:ReturnCreditAccountDueAgeDetails>false</ns0:ReturnCreditAccountDueAgeDetails>
               <ns0:ReturnDirectDebitDetails>false</ns0:ReturnDirectDebitDetails>
               <ns0:ReturnCreditCycleDetails>false</ns0:ReturnCreditCycleDetails>
               <ns0:ReturnCreditAccountCustomValues>false</ns0:ReturnCreditAccountCustomValues>
               <ns0:ReturnCreditAccountStatistics>false</ns0:ReturnCreditAccountStatistics>
               <ns0:ReturnCreditAccountPendingPayments>false</ns0:ReturnCreditAccountPendingPayments>
               <ns0:ReturnAccountAuthorizationLimits>false</ns0:ReturnAccountAuthorizationLimits>
               <ns0:ReturnAccountAuthorizationOverrides>false</ns0:ReturnAccountAuthorizationOverrides>
               <ns0:ReturnAccountBlockCodes>false</ns0:ReturnAccountBlockCodes>
               <ns0:ReturnCardDetails>true</ns0:ReturnCardDetails>
               <ns0:ReturnExtendedCardDetails>false</ns0:ReturnExtendedCardDetails>
               <ns0:ReturnPinDetails>false</ns0:ReturnPinDetails>
               <ns0:ReturnCardAddressDetails>false</ns0:ReturnCardAddressDetails>
               <ns0:ReturnCardSupportingDocumentsDetails>false</ns0:ReturnCardSupportingDocumentsDetails>
               <ns0:ReturnCardAuthorizationLimits>false</ns0:ReturnCardAuthorizationLimits>
               <ns0:ReturnCardCustomValues>false</ns0:ReturnCardCustomValues>
               <ns0:ReturnCardProductDetails>false</ns0:ReturnCardProductDetails>
               <ns0:ReturnCardStatusDetails>false</ns0:ReturnCardStatusDetails>
               <ns0:ReturnCardIssuerRisk>false</ns0:ReturnCardIssuerRisk>
               <ns0:ReturnDelinquencyDetails>false</ns0:ReturnDelinquencyDetails>
            </ns0:AdditionalData>
         </ns0:CustomerAccountCardInquiryRequestDetails>
      </ns0:CustomerAccountCardInquiryRequest>
   </S:Body>
</S:Envelope>